{
    "Alex": "A 28-year-old graphic designer favoring Scandinavian minimalist styles. Prefers monochrome palettes (black, white, grey), high-quality natural fabrics (linen, wool), clean geometric cuts, and avoids logos or excessive detailing.",
    "Morgan": "A 22-year-old college student deeply into 90s grunge and vintage band tees. Loves oversized flannel shirts, ripped denim, Doc Martens, layering slip dresses, and collecting unique pins for her denim jacket.",
    "Taylor": "A 31-year-old corporate lawyer adhering to a strict business formal dress code. Invests in powerful pantsuits, tailored sheath dresses in conservative colors (navy, charcoal), silk blouses, and classic pumps.",
    "Casey": "A 24-year-old photographer with a maximalist, color-driven style. Enjoys mixing bold, clashing prints (animal, floral, abstract), layering textures, statement jewelry, and brightly colored sneakers or platform boots.",
    "Skylar": "A 29-year-old environmental activist exclusively wearing sustainable and ethically sourced clothing. Prefers natural fibers (organic cotton, hemp, Tencel), earthy tones, upcycled garments, and brands with transparent supply chains.",
    "Mika": "A 19-year-old social media influencer focused on Y2K revival and Harajuku-inspired trends. Loves mini skirts, cropped graphic tops, platform sandals, neon accents, plush accessories, and experimenting with layered, colorful looks.",
    "Quinn": "A 26-year-old conceptual artist whose wardrobe is performance art. Wears deconstructed garments, experimental silhouettes, clothing made from unusual recycled materials, and often incorporates sculptural elements.",
    "Sage": "A 28-year-old yoga instructor living in athleisure wear. Prioritizes comfort, stretch, and breathability with leggings, wrap tops, bamboo-fabric hoodies, and minimalist sandals, focusing on soft, calming colors.",
    "Avery": "A 30-year-old graphic novelist with a 'dark academia' aesthetic. Favors tweed blazers, turtlenecks, plaid trousers or skirts, oxford shoes, vintage-style satchels, and garments in muted, scholarly tones like brown, burgundy, and forest green.",
    "Blair": "A 34-year-old interior designer with a 'quiet luxury' style. Prefers timeless, logo-free pieces in luxurious fabrics like cashmere, silk, and fine wool. Gravitates towards neutral tones, elegant draping, and understated, high-quality accessories.",
    "Harper": "A 27-year-old music blogger specializing in streetwear. Collects limited-edition sneakers, wears oversized hoodies, cargo pants, puffer vests, and utilitarian-inspired accessories like cross-body bags and beanies.",
    "Dylan": "A 23-year-old aspiring actor with a flair for theatrical, vintage-inspired glamour. Enjoys faux fur coats, velvet blazers, wide-leg palazzo pants, statement hats, and bold, dramatic makeup.",
    "Charlie": "A 38-year-old politician focused on classic American prep style. Prefers tailored navy blazers, chino pants, crisp button-down shirts (often Brooks Brothers), loafers, and subtle patriotic color accents.",
    "Maya": "A 25-year-old bookstore owner embracing a 'cottagecore' aesthetic. Loves flowy linen dresses, floral prairie skirts, hand-knitted cardigans, embroidered details, and comfortable leather ankle boots.",
    "Chloe": "A 30-year-old marketing executive with a sharp, power-dressing style. Favors bold shoulder blazers, asymmetric tops, leather pencil skirts, stiletto heels, and statement metallic jewelry.",
    "Isabelle": "A 21-year-old art student cultivating a 'light academia' look mixed with Parisian chic. Enjoys Breton stripes, trench coats, high-waisted trousers, loafers or ballet flats, silk scarves, and a minimalist color palette.",
    "Naomi": "A 35-year-old architect drawn to Japanese minimalist and androgynous fashion. Prefers oversized, architectural silhouettes, wide-leg trousers, monochrome layering (often black), Yohji Yamamoto or Issey Miyake influences, and platform oxfords.",
    "Sophia": "A 27-year-old travel nurse prioritizing extreme comfort and practicality for off-duty wear. Seeks out ultra-soft joggers, washable merino wool sweaters, supportive slip-on sneakers, and easy-to-pack, wrinkle-resistant fabrics.",
    "Jordan": "A 35-year-old fitness instructor focused on high-performance athletic wear. Prefers technical fabrics, compression gear, brightly colored running shoes, and branded sportswear (Nike, Lululemon).",
    "Sam": "A 27-year-old tech entrepreneur interested in futuristic 'techwear'. Wears clothing with integrated tech features, water-resistant shells, lots of pockets, magnetic closures, often in black or grey palettes with brands like Acronym.",
    "Parker": "A 40-year-old chef valuing durability and stain resistance. Wears professional chef coats, checked kitchen trousers, non-slip clogs, and simple, easy-to-launder cotton t-shirts outside of work.",
    "Blake": "A 33-year-old travel blogger embracing a rugged 'adventurecore' style. Needs versatile, multi-functional clothing like convertible hiking pants, merino wool base layers, packable down jackets, and durable hiking boots.",
    "Jamie": "A 26-year-old professional gamer influenced by Japanese streetwear and anime culture. Loves oversized hoodies with anime graphics, technical joggers, collectible high-top sneakers, and often wears caps or bucket hats.",
    "Emerson": "A 32-year-old scientist who dresses in practical, classic 'normcore'. Prefers simple crewneck sweaters, well-fitting non-distressed jeans, plain t-shirts, comfortable Clarks or New Balance sneakers, and avoids logos or trends.",
    "Riley": "A 25-year-old musician with a 'goth' aesthetic. Exclusively wears black clothing, favoring skinny jeans or cargo pants, long draped cardigans, band tees (The Cure, Siouxsie), heavy buckled boots, and silver jewelry.",
    "Leo": "A 29-year-old software developer with a relaxed, 'dad-core' casual style. Often wears comfortable fleece vests, slightly faded jeans, tech-company t-shirts (often free swag), practical running shoes, and maybe a baseball cap.",
    "Ethan": "A 36-year-old history professor specializing in Victorian literature, reflecting this in his 'historical dandy' style. Prefers tweed waistcoats, high-collared shirts, ascots or cravats, pocket watches, and well-polished brogues.",
    "Noah": "A 24-year-old bartender channeling a 1950s rockabilly look. Likes cuffed dark wash jeans, bowling shirts or Western shirts with embroidery, slicked-back hair, leather jackets, and Converse sneakers or engineer boots.",
    "Caleb": "A 31-year-old financial analyst required to wear ultra-conservative business professional attire. Sticks to charcoal and navy bespoke suits, white or light blue French cuff shirts, Hermes ties, and meticulously polished cap-toe oxfords.",
    "Mason": "A 28-year-old landscape architect needing rugged workwear influenced by heritage brands. Prefers durable waxed canvas jackets (like Barbour or Filson), flannel-lined pants, Henley shirts, sturdy work boots (Red Wing), and practical layering pieces."
}